## iam plan
```
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_iam_policy_document.r53_read_policy_document: Reading...
aws_iam_policy.github_dormant_user_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/DormantUserS3Access]
data.aws_iam_policy_document.r53_read_policy_document: Read complete after 0s [id=2046999383]
aws_iam_policy.r53_read_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/r53_read_policy]
data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::880656497252:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Reading...
data.aws_iam_policy_document.github_actions_assume_role_policy_document: Read complete after 0s [id=1148193360]
aws_iam_role.r53_backup_role: Refreshing state... [id=operations-engineering-r53-backup-role]
aws_iam_role.github_dormant_user_role: Refreshing state... [id=github_dormant_user_role]
aws_iam_role_policy_attachment.role_policy_attachment: Refreshing state... [id=github_dormant_user_role-20240422144734306600000001]
github_actions_secret.aws_role_arn: Refreshing state... [id=operations-engineering:GH_DORMANT_USER_AWS_ROLE_ARN]
aws_iam_role_policy_attachment.r53_read_policy_attachment: Refreshing state... [id=operations-engineering-r53-backup-role-20240227095015143600000001]
github_actions_secret.role_arn: Refreshing state... [id=operations-engineering:AWS_DSD_R53_EXPORT_ROLE_ARN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.dns_change_records_policy will be created
  + resource "aws_iam_policy" "dns_change_records_policy" {
      + arn         = (known after apply)
      + description = "A policy that allows modification of the Route53 record sets for the dns-test.service.justice.gov.uk hosted zone."
      + id          = (known after apply)
      + name        = "Route53ChangeRecordsPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/test-dns.service.justice.gov.uk"
                    },
                  + {
                      + Action   = [
                          + "route53:GetHostedZone",
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.github_dormant_user_role will be updated in-place
  ~ resource "aws_iam_role" "github_dormant_user_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/operations-engineering-dns-spike:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "github_dormant_user_role"
        name                  = "github_dormant_user_role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.octodns_role will be created
  + resource "aws_iam_role" "octodns_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/operations-engineering-dns-spike:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::880656497252:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "octodns_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.r53_backup_role will be updated in-place
  ~ resource "aws_iam_role" "r53_backup_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:ministryofjustice/operations-engineering:*" -> [
                                  + "repo:ministryofjustice/operations-engineering:*",
                                  + "repo:ministryofjustice/operations-engineering-dns-spike:*",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "operations-engineering-r53-backup-role"
        name                  = "operations-engineering-r53-backup-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.octo_dns_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "octo_dns_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "octodns_role"
    }

  # github_actions_secret.octodns_role will be created
  + resource "github_actions_secret" "octodns_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "operations-engineering-dns-spike"
      + secret_name     = "OCTODNS_AWS_ROLE_ARN"
      + updated_at      = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```